measurements/wsgi_benchmark_50_ms/worker_thread_results.txt

1 workers and 1 threads
Running 90m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.32s    47.11ms   3.33s    99.94%
    Req/Sec     0.00      0.04     9.00     99.98%
  104158 requests in 90.00m, 34.57MB read
Requests/sec:     19.29
Transfer/sec:      6.55KB
latency_values:
{"Min": 53.872, "Max": 3333.130, "Avg": 3317.091, "Stdev": 47.108}
request_values:
{"Min": 0, "Max": 9, "Avg": 0, "Stdev": 0}
latency_distribution:
{"1%": 3315.498, "25%": 3317.252, "50%": 3318.042, "75%": 3318.881, "90%": 3319.677, "99%": 3321.360, "99.9%": 3328.433, "99.99%": 3332.435 }
percentiles:
{"percentiles": [ 3315.498, 3315.825, 3315.986, 3316.114, 3316.223, 3316.315, 3316.400, 3316.471, 3316.541, 3316.603, 3316.662, 3316.713, 3316.765, 3316.811, 3316.857, 3316.905, 3316.949, 3316.990, 3317.031, 3317.070, 3317.108, 3317.145, 3317.180, 3317.216, 3317.252, 3317.285, 3317.319, 3317.351, 3317.384, 3317.416, 3317.448, 3317.480, 3317.513, 3317.544, 3317.577, 3317.607, 3317.640, 3317.671, 3317.704, 3317.735, 3317.768, 3317.798, 3317.830, 3317.860, 3317.891, 3317.921, 3317.952, 3317.982, 3318.013, 3318.042, 3318.073, 3318.103, 3318.133, 3318.163, 3318.194, 3318.226, 3318.257, 3318.290, 3318.324, 3318.355, 3318.388, 3318.419, 3318.454, 3318.486, 3318.519, 3318.553, 3318.588, 3318.621, 3318.657, 3318.692, 3318.728, 3318.766, 3318.803, 3318.842, 3318.881, 3318.919, 3318.960, 3319.001, 3319.044, 3319.089, 3319.135, 3319.183, 3319.233, 3319.286, 3319.342, 3319.402, 3319.462, 3319.525, 3319.598, 3319.677, 3319.756, 3319.853, 3319.948, 3320.057, 3320.193, 3320.340, 3320.559, 3320.841, 3321.360, 3333.130]}

80 workers and 1 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   168.16ms  162.45ms 685.11ms   82.32%
    Req/Sec    12.20      7.21    20.00     36.81%
  449620 requests in 15.00m, 149.22MB read
Requests/sec:    499.52
Transfer/sec:    169.76KB
latency_values:
{"Min": 51.487, "Max": 685.113, "Avg": 168.162, "Stdev": 162.454}
request_values:
{"Min": 1, "Max": 20, "Avg": 12, "Stdev": 7}
latency_distribution:
{"1%": 51.854, "25%": 52.112, "50%": 103.414, "75%": 235.011, "90%": 418.520, "99%": 675.034, "99.9%": 679.678, "99.99%": 683.656 }
percentiles:
{"percentiles": [ 51.854, 51.887, 51.908, 51.925, 51.938, 51.950, 51.960, 51.969, 51.977, 51.985, 51.994, 52.001, 52.009, 52.017, 52.025, 52.033, 52.041, 52.049, 52.058, 52.066, 52.075, 52.084, 52.093, 52.103, 52.112, 52.122, 52.132, 52.143, 52.154, 52.165, 52.177, 52.190, 52.203, 52.216, 52.230, 52.245, 52.261, 52.279, 52.301, 52.328, 52.364, 52.412, 52.489, 52.595, 52.713, 52.857, 102.938, 103.230, 103.333, 103.414, 103.484, 103.552, 103.616, 103.680, 103.742, 103.804, 103.868, 103.941, 104.026, 104.153, 104.469, 154.979, 155.505, 155.991, 159.774, 161.628, 163.286, 182.108, 183.034, 183.917, 209.317, 210.648, 211.842, 234.040, 235.011, 235.976, 288.363, 290.070, 291.886, 310.460, 311.338, 312.356, 337.767, 339.036, 340.409, 362.403, 363.329, 364.526, 416.904, 418.520, 421.795, 466.114, 467.338, 470.034, 545.224, 546.816, 553.326, 673.447, 675.034, 685.113]}

2 workers and 32 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.17ms   11.46ms 129.43ms   69.12%
    Req/Sec    12.80      4.50    20.00     71.82%
  736814 requests in 15.00m, 244.53MB read
Requests/sec:    818.59
Transfer/sec:    278.19KB
latency_values:
{"Min": 51.670, "Max": 129.428, "Avg": 78.173, "Stdev": 11.458}
request_values:
{"Min": 4, "Max": 20, "Avg": 12, "Stdev": 4}
latency_distribution:
{"1%": 52.634, "25%": 72.389, "50%": 80.130, "75%": 85.260, "90%": 90.902, "99%": 103.239, "99.9%": 111.958, "99.99%": 118.527 }
percentiles:
{"percentiles": [ 52.634, 53.334, 54.221, 55.130, 55.964, 56.719, 57.440, 58.171, 58.893, 59.657, 60.430, 61.228, 62.050, 62.867, 63.710, 64.537, 65.364, 66.230, 67.143, 68.056, 68.985, 69.925, 70.823, 71.655, 72.389, 73.044, 73.602, 74.113, 74.581, 74.991, 75.380, 75.740, 76.075, 76.388, 76.685, 76.975, 77.244, 77.509, 77.760, 78.000, 78.235, 78.462, 78.684, 78.902, 79.116, 79.324, 79.529, 79.733, 79.934, 80.130, 80.326, 80.522, 80.716, 80.911, 81.103, 81.293, 81.486, 81.674, 81.866, 82.061, 82.250, 82.449, 82.645, 82.841, 83.039, 83.241, 83.448, 83.652, 83.867, 84.082, 84.307, 84.534, 84.769, 85.012, 85.260, 85.522, 85.788, 86.066, 86.356, 86.663, 86.982, 87.316, 87.670, 88.049, 88.444, 88.869, 89.307, 89.805, 90.329, 90.902, 91.530, 92.244, 93.039, 93.953, 95.025, 96.274, 97.853, 99.941, 103.239, 129.428]}

3 workers and 32 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    57.21ms    6.51ms  99.11ms   81.18%
    Req/Sec    17.49      4.33    20.00     75.07%
  1006754 requests in 15.00m, 334.12MB read
Requests/sec:   1118.49
Transfer/sec:    380.11KB
latency_values:
{"Min": 51.438, "Max": 99.112, "Avg": 57.211, "Stdev": 6.510}
request_values:
{"Min": 9, "Max": 20, "Avg": 17, "Stdev": 4}
latency_distribution:
{"1%": 51.715, "25%": 52.364, "50%": 54.005, "75%": 60.988, "90%": 67.553, "99%": 76.656, "99.9%": 83.654, "99.99%": 88.537 }
percentiles:
{"percentiles": [ 51.715, 51.753, 51.779, 51.800, 51.818, 51.835, 51.851, 51.866, 51.880, 51.895, 51.909, 51.924, 51.939, 51.954, 51.971, 51.990, 52.011, 52.034, 52.062, 52.094, 52.134, 52.183, 52.240, 52.300, 52.364, 52.429, 52.493, 52.550, 52.602, 52.649, 52.693, 52.733, 52.775, 52.816, 52.860, 52.906, 52.957, 53.012, 53.070, 53.134, 53.203, 53.279, 53.364, 53.455, 53.547, 53.638, 53.727, 53.818, 53.908, 54.005, 54.107, 54.220, 54.346, 54.487, 54.640, 54.796, 54.961, 55.137, 55.328, 55.537, 55.759, 55.997, 56.253, 56.532, 56.839, 57.163, 57.515, 57.884, 58.284, 58.710, 59.142, 59.593, 60.057, 60.520, 60.988, 61.446, 61.901, 62.347, 62.786, 63.215, 63.646, 64.064, 64.486, 64.899, 65.319, 65.741, 66.179, 66.625, 67.074, 67.553, 68.044, 68.579, 69.166, 69.820, 70.577, 71.483, 72.620, 74.164, 76.656, 99.112]}

4 workers and 32 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    52.19ms    0.88ms  74.23ms   90.59%
    Req/Sec    19.18      2.73    20.00     91.90%
  1103542 requests in 15.00m, 366.24MB read
Requests/sec:   1226.02
Transfer/sec:    416.66KB
latency_values:
{"Min": 51.173, "Max": 74.231, "Avg": 52.192, "Stdev": 0.885}
request_values:
{"Min": 9, "Max": 20, "Avg": 19, "Stdev": 2}
latency_distribution:
{"1%": 51.599, "25%": 51.789, "50%": 51.891, "75%": 52.118, "90%": 53.012, "99%": 55.999, "99.9%": 60.082, "99.99%": 64.722 }
percentiles:
{"percentiles": [ 51.599, 51.629, 51.648, 51.662, 51.674, 51.684, 51.693, 51.701, 51.708, 51.715, 51.721, 51.728, 51.733, 51.739, 51.744, 51.749, 51.754, 51.759, 51.764, 51.768, 51.773, 51.777, 51.781, 51.785, 51.789, 51.794, 51.798, 51.802, 51.806, 51.810, 51.814, 51.818, 51.821, 51.825, 51.829, 51.833, 51.837, 51.841, 51.845, 51.849, 51.853, 51.857, 51.861, 51.865, 51.869, 51.874, 51.878, 51.882, 51.887, 51.891, 51.896, 51.901, 51.905, 51.910, 51.915, 51.921, 51.926, 51.932, 51.937, 51.943, 51.950, 51.956, 51.963, 51.970, 51.978, 51.986, 51.995, 52.004, 52.015, 52.026, 52.039, 52.054, 52.072, 52.092, 52.118, 52.149, 52.190, 52.242, 52.310, 52.389, 52.467, 52.534, 52.590, 52.640, 52.688, 52.738, 52.792, 52.853, 52.924, 53.012, 53.126, 53.287, 53.476, 53.643, 53.813, 54.030, 54.405, 54.954, 55.999, 74.231]}

4 workers and 16 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    54.48ms    3.80ms 106.48ms   90.23%
    Req/Sec    18.37      3.68    20.00     83.83%
  1057184 requests in 15.00m, 350.86MB read
Requests/sec:   1174.52
Transfer/sec:    399.15KB
latency_values:
{"Min": 51.317, "Max": 106.477, "Avg": 54.482, "Stdev": 3.804}
request_values:
{"Min": 9, "Max": 20, "Avg": 18, "Stdev": 3}
latency_distribution:
{"1%": 51.613, "25%": 51.935, "50%": 53.351, "75%": 55.489, "90%": 58.194, "99%": 71.330, "99.9%": 77.005, "99.99%": 80.058 }
percentiles:
{"percentiles": [ 51.613, 51.649, 51.673, 51.693, 51.709, 51.724, 51.738, 51.750, 51.762, 51.774, 51.785, 51.796, 51.807, 51.817, 51.827, 51.838, 51.848, 51.858, 51.869, 51.879, 51.890, 51.901, 51.912, 51.923, 51.935, 51.947, 51.960, 51.973, 51.988, 52.003, 52.019, 52.038, 52.058, 52.083, 52.114, 52.154, 52.214, 52.312, 52.456, 52.591, 52.714, 52.832, 52.940, 53.022, 53.090, 53.149, 53.204, 53.255, 53.304, 53.351, 53.399, 53.446, 53.495, 53.545, 53.598, 53.654, 53.714, 53.782, 53.857, 53.944, 54.043, 54.160, 54.295, 54.445, 54.592, 54.718, 54.827, 54.920, 55.005, 55.089, 55.169, 55.247, 55.324, 55.404, 55.489, 55.577, 55.671, 55.773, 55.881, 56.002, 56.133, 56.276, 56.433, 56.605, 56.796, 57.012, 57.250, 57.518, 57.828, 58.194, 58.620, 59.146, 59.797, 60.669, 61.890, 63.443, 65.390, 68.188, 71.330, 106.477]}

3 workers and 16 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    69.06ms    7.78ms 151.72ms   62.88%
    Req/Sec    14.49      4.98    20.00     54.75%
  833985 requests in 15.00m, 276.78MB read
Requests/sec:    926.55
Transfer/sec:    314.88KB
latency_values:
{"Min": 52.478, "Max": 151.716, "Avg": 69.064, "Stdev": 7.778}
request_values:
{"Min": 4, "Max": 20, "Avg": 14, "Stdev": 4}
latency_distribution:
{"1%": 58.494, "25%": 62.468, "50%": 67.132, "75%": 74.959, "90%": 81.000, "99%": 86.821, "99.9%": 89.612, "99.99%": 95.612 }
percentiles:
{"percentiles": [ 58.494, 58.790, 59.023, 59.229, 59.420, 59.601, 59.774, 59.944, 60.107, 60.269, 60.425, 60.574, 60.719, 60.863, 61.006, 61.144, 61.284, 61.422, 61.564, 61.707, 61.854, 62.003, 62.154, 62.306, 62.468, 62.631, 62.798, 62.974, 63.154, 63.331, 63.514, 63.697, 63.884, 64.068, 64.249, 64.427, 64.609, 64.790, 64.974, 65.158, 65.343, 65.532, 65.719, 65.909, 66.104, 66.302, 66.506, 66.711, 66.921, 67.132, 67.348, 67.577, 67.813, 68.057, 68.311, 68.578, 68.842, 69.116, 69.400, 69.685, 69.977, 70.275, 70.580, 70.897, 71.227, 71.575, 71.924, 72.283, 72.650, 73.033, 73.419, 73.800, 74.189, 74.565, 74.959, 75.345, 75.730, 76.117, 76.503, 76.880, 77.270, 77.661, 78.060, 78.476, 78.891, 79.298, 79.713, 80.133, 80.558, 81.000, 81.465, 81.948, 82.466, 83.024, 83.620, 84.255, 84.964, 85.768, 86.821, 151.716]}

4 workers and 16 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.60ms    2.59ms  79.93ms   91.43%
    Req/Sec    18.67      3.38    20.00     86.87%
  1074623 requests in 15.00m, 356.64MB read
Requests/sec:   1193.89
Transfer/sec:    405.74KB
latency_values:
{"Min": 51.358, "Max": 79.934, "Avg": 53.596, "Stdev": 2.586}
request_values:
{"Min": 9, "Max": 20, "Avg": 18, "Stdev": 3}
latency_distribution:
{"1%": 51.616, "25%": 51.927, "50%": 53.182, "75%": 53.987, "90%": 55.771, "99%": 65.859, "99.9%": 73.090, "99.99%": 76.043 }
percentiles:
{"percentiles": [ 51.616, 51.652, 51.676, 51.695, 51.711, 51.725, 51.738, 51.751, 51.762, 51.773, 51.784, 51.794, 51.804, 51.815, 51.825, 51.834, 51.844, 51.854, 51.864, 51.874, 51.884, 51.894, 51.905, 51.916, 51.927, 51.939, 51.951, 51.963, 51.977, 51.991, 52.006, 52.024, 52.044, 52.067, 52.095, 52.132, 52.186, 52.273, 52.419, 52.559, 52.673, 52.781, 52.872, 52.944, 52.999, 53.045, 53.084, 53.119, 53.152, 53.182, 53.212, 53.240, 53.266, 53.292, 53.318, 53.344, 53.370, 53.396, 53.421, 53.448, 53.475, 53.502, 53.529, 53.558, 53.587, 53.617, 53.649, 53.681, 53.716, 53.754, 53.794, 53.837, 53.883, 53.933, 53.987, 54.045, 54.109, 54.179, 54.255, 54.338, 54.429, 54.528, 54.635, 54.750, 54.876, 55.015, 55.167, 55.342, 55.540, 55.771, 56.045, 56.380, 56.793, 57.300, 57.978, 58.853, 60.178, 62.257, 65.859, 79.934]}

2 workers and 64 threads
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.11ms   12.05ms 130.16ms   70.26%
    Req/Sec    12.65      4.43    20.00     73.33%
  728103 requests in 15.00m, 241.64MB read
Requests/sec:    808.91
Transfer/sec:    274.90KB
latency_values:
{"Min": 51.243, "Max": 130.162, "Avg": 79.108, "Stdev": 12.054}
request_values:
{"Min": 4, "Max": 20, "Avg": 12, "Stdev": 4}
latency_distribution:
{"1%": 52.266, "25%": 75.229, "50%": 81.364, "75%": 86.224, "90%": 92.027, "99%": 104.197, "99.9%": 112.297, "99.99%": 117.628 }
percentiles:
{"percentiles": [ 52.266, 52.838, 53.252, 53.830, 54.444, 55.119, 55.827, 56.547, 57.294, 58.073, 58.881, 59.715, 60.582, 61.518, 62.584, 63.774, 65.122, 66.684, 68.354, 70.127, 71.737, 72.994, 73.921, 74.631, 75.229, 75.720, 76.151, 76.527, 76.873, 77.191, 77.485, 77.764, 78.023, 78.270, 78.503, 78.727, 78.945, 79.152, 79.356, 79.556, 79.747, 79.937, 80.120, 80.304, 80.486, 80.663, 80.840, 81.018, 81.190, 81.364, 81.536, 81.709, 81.876, 82.050, 82.222, 82.394, 82.564, 82.738, 82.911, 83.091, 83.270, 83.456, 83.643, 83.835, 84.023, 84.217, 84.414, 84.622, 84.827, 85.038, 85.260, 85.490, 85.723, 85.969, 86.224, 86.485, 86.758, 87.040, 87.331, 87.650, 87.980, 88.324, 88.690, 89.084, 89.494, 89.931, 90.395, 90.901, 91.444, 92.027, 92.682, 93.406, 94.236, 95.162, 96.214, 97.470, 99.007, 101.031, 104.197, 130.162]}